Tekla.Structures.ModelInternal.BentPlateTools
BentPlateTools is a utility class to handle bent plate related computations

Tekla.Structures.ModelInternal.BentPlateTools.GetMinimumRadius(Tekla.Structures.Model.Part)
Returns the minimum radius for bend sections in a given bent plate
bentPlate: the bent plate under consideration
Returns: The minimum radius for a bend sections in bentPlate

Tekla.Structures.ModelInternal.BentPlateTools.GetMaximumRadiuses(System.Int32,Tekla.Structures.Model.ConnectiveGeometry)
Returns the maximum radius for bend section with given parameters.
geometryNodeId: Bend node id in the tree
geometry: Bent plate gometry containing geometryNodeId
Returns: the maximum radius for bend section with given parameters.

Tekla.Structures.ModelInternal.BentPlateTools.ModifyCurveType(Tekla.Structures.Model.ConnectiveGeometry,System.Int32,System.Int32)
Modifies bend section curve type of the selected geometry node to Smooth, Narrow or Wide.
geometry: The geometry tree containing the bend section to be modified.
geometryNodeId: The index of the geometry node, which is its rank in the breadth-first traversal of the geometry tree (root id is 0).
newCurveType: Type of the curve to be created.
Throws Tekla.Structures.Model.ConnectiveGeometryException: Thrown if could not modify curve type of the bend surface section.

Tekla.Structures.ModelInternal.BentPlateTools.ExtractBentPlateFromComponent(Tekla.Structures.Identifier)
If bent plate is in a component, extracts it from the component and assigns it a new Identifier.
partId: Identifier of the bent plate to extract
Returns: partId or a new identifier if the bent plate was effectively extracted